Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t
Struct for curves.

Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t.MaxCurvePoints
The maximum number of curve points.

Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t.nPoints
The number of points.

Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t.aPoints
The curve points.

Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t.aIsArc
Indicates whether the point forms an arc.